# PlayWrite INI for LOTRO english and german

[System]
# List of locales PlayWrite has been localized to in AHK DropDown format
SysLocales=English||Deutsch
# Identifier of the server within control-channel and logfile
cfDirector=Director
# Identifier of comment lines in plays (*.pwt)
pwt_Comment=^#
# String to send to target system before text in AHK format
com_PreOut={Enter}
# String to send to target system after text in AHK format
com_PostOut={Enter}
# Default pause for every line send to target system
com_DefPauseEOL=2000
# Regexp cleaning lines from logfile
cfLineClean=^.+?\].+?\: (.+)
# Timer for polling for new lines in logfile
cfFilePollTime=300

[English]
# Identifying part of windows name of target system
com_WinOutput=Lord of the Rings Online
# Pretext for putting out 'spoken' lines, including trailing space, through target system.
com_Channel=/say 
# Pretext for sending PlayWrite control communication, including trailing space, through target system.
pwt_Channel=/f 
# Following lines for additional chat-commands within the target system
freemote=em
musicon=music
musicoff=music off
playabc=play
playstart=playstart

[Deutsch]
com_WinOutput=Herr der Ringe Online
com_Channel=/sagen 
pwt_Channel=/g 
freemote=emote
musicon=musik
musicoff=musik aus
playabc=spielen
playstart=spielstart
# Following are fixed ./emotes which need to be localized
burp=rülpsen
cheer=jubeln
dance=tanzen
yes=ja
ahem=ähem
story=geschichte
hug=umarmen
shrug=achselzucken
confused=verwirrt
impatient=ungeduldig
grumble=motzen
no=nein
fidget=zappeln
whippitydo=ohwietoll
clap=klatschen
challenge=herausfordern
salute=salutieren
crazy=verrückt
resist=widerstehen
smackhead=stirnschlag
mourn=trauern
flex=muskelspiel
congratulate=gratulieren
tantrum=wutanfall
scold=ausschimpfen
shakefist=faustschütteln
beg=flehen
ready=bereit
fight=streiten
sorry=entschuldigen
succumb=verzweifeln
cower=kauern
wince=zusammenzucken
cry=heul
cough=hüsteln
rest=ausruhen
roar=brüllen
point=zeigen
think=nachdenken
